In [15]:
 #Data Imports
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

import os
## get the working directory
os.getcwd()

# Plot imports
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style('whitegrid')

%matplotlib inline
from sklearn import linear_model

In [42]:
# Create an example dataframe
data = {'name': ['A', 'B', 'C', 'D', 'E', 'f'], 
        'score': [1,2,3,4,5, 6]}
df = pd.DataFrame(data)

In [43]:
# convert just columns "a" and "b"
df[["score"]] = df[["score"]].apply(pd.to_numeric)

In [17]:
# Select rows of the dataframe where df.score is greater than 1 and less and 5
#df[(df['score'] == 1) | (df['score'] == 5) |(df['score'] == 2)]

  name score
0    A     1
1    B     2
4    E     5

In [47]:
## division in python
df['d'] = df['score']-2
df

  name  score  d
0    A      1 -1
1    B      2  0
2    C      3  1
3    D      4  2
4    E      5  3
5    f      6  4

## Division in python
columns_to_divide = ['open', 'close']
df[columns_to_divide] = df[columns_to_divide] / df['prev']

In [21]:
 
df = pd.DataFrame(np.random.randint(1, 5, size=(5, 2)), columns=['a', 'b'])
 
# divide is equivalent to df['a']/df['b']
# but with support to substitute a fill_value for missing data
 
# introduce missing data
df.loc[1, 'a'] = None
 
df['c'] = df['a'].divide(df['b'], fill_value=1)
df['d'] = df['a']/df['b']

In [22]:
df

     a  b         c         d
0  3.0  3  1.000000  1.000000
1  NaN  4  0.250000       NaN
2  3.0  1  3.000000  3.000000
3  3.0  2  1.500000  1.500000
4  1.0  3  0.333333  0.333333

In [23]:
 
df = pd.DataFrame(np.random.randint(1, 5, size=(5, 2)), columns=['a', 'b'])
 
# divide is equivalent to df['a']/df['b']
# but with support to substitute a fill_value for missing data
 
# introduce missing data
df.loc[1, 'a'] = None
 
df['c'] = df['a'].divide(df['b'], fill_value=1)
df['d'] = df['a']/2

In [24]:
df

     a  b         c    d
0  1.0  3  0.333333  0.5
1  NaN  2  0.500000  NaN
2  1.0  4  0.250000  0.5
3  1.0  1  1.000000  0.5
4  1.0  2  0.500000  0.5